results/res/h200_agg_tp2_32b_image4_768p_np_rates/test_sglang_multi_rates_768p_20260516_212030/rate_0.5/results.txt
benchmark_args=Namespace(backend='sglang-oai-chat', base_url='http://localhost:7001', host='0.0.0.0', port=None, ready_check_timeout_sec=60, dataset_name='image', dataset_path='', model='/mnt/weka/data/llm-d-models-pv/models--Qwen--Qwen3-VL-32B-Instruct-FP8', served_model_name=None, tokenizer=None, num_prompts=128, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=128, random_output_len=256, random_range_ratio=0.0, image_count=4, image_resolution='1024x768', random_image_count=False, image_format='jpeg', image_content='random', request_rate=0.5, use_trace_timestamps=False, max_concurrency=None, output_file='/hongming/res/h200_agg_tp2_32b_image4_768p_np_rates/test_sglang_multi_rates_768p_20260516_212030/rate_0.5/benchmark_output.json', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=0, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://localhost:7001/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang-oai-chat', base_url='http://localhost:7001', host='0.0.0.0', port=30000, ready_check_timeout_sec=60, dataset_name='image', dataset_path='', model='/mnt/weka/data/llm-d-models-pv/models--Qwen--Qwen3-VL-32B-Instruct-FP8', served_model_name=None, tokenizer=None, num_prompts=128, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=128, random_output_len=256, random_range_ratio=0.0, image_count=4, image_resolution='1024x768', random_image_count=False, image_format='jpeg', image_content='random', request_rate=0.5, use_trace_timestamps=False, max_concurrency=None, output_file='/hongming/res/h200_agg_tp2_32b_image4_768p_np_rates/test_sglang_multi_rates_768p_20260516_212030/rate_0.5/benchmark_output.json', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=0, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=True, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 403717
#Output tokens: 15195
#Total images: 512
#Images per request: 4 (fixed)

Created 128 random jpeg images with average 3167785 bytes per request
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 128/128 [04:15<00:00,  1.99s/it]

============ Serving Benchmark Result ============
Backend:                                 sglang-oai-chat
Traffic request rate:                    0.5       
Max request concurrency:                 not set   
Successful requests:                     128       
Benchmark duration (s):                  255.05    
Total input tokens:                      403717    
Total input text tokens:                 9477      
Total input vision tokens:               394240    
Total generated tokens:                  15195     
Total generated tokens (retokenized):    15192     
Request throughput (req/s):              0.50      
Input token throughput (tok/s):          1582.88   
Output token throughput (tok/s):         59.58     
Peak output token throughput (tok/s):    397.00    
Peak concurrent requests:                7         
Total token throughput (tok/s):          1642.46   
Concurrency:                             1.31      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   2601.61   
Median E2E Latency (ms):                 2470.33   
P90 E2E Latency (ms):                    4045.20   
P99 E2E Latency (ms):                    5786.53   
---------------Time to First Token----------------
Mean TTFT (ms):                          838.46    
Median TTFT (ms):                        769.05    
P99 TTFT (ms):                           1181.68   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          18.42     
Median TPOT (ms):                        13.39     
P99 TPOT (ms):                           73.16     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           15.98     
Median ITL (ms):                         11.07     
P95 ITL (ms):                            12.19     
P99 ITL (ms):                            217.04    
Max ITL (ms):                            982.49    
==================================================